---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.AssocpropNeedJog
source: html/11494dda-5d92-0d45-31b2-47d4540ac281.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.AssocpropNeedJog Property

Need to add jog in order to satisfy constraints

## Syntax (C#)
```csharp
public static FailureDefinitionId AssocpropNeedJog { get; }
```